Revit 2027 API
SweptBlend.TopProfileSymbol Property
The top family symbol profile of the swept blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySymbolProfile TopProfileSymbol { get; }
Public ReadOnly Property TopProfileSymbol As FamilySymbolProfile
	Get
public:
property FamilySymbolProfile^ TopProfileSymbol {
	FamilySymbolProfile^ get ();
}
member TopProfileSymbol : FamilySymbolProfile with get
Property Value
FamilySymbolProfile
Remarks
If the top profile is sketch-based, this property is null.
See Also
Reference
SweptBlend Class
Autodesk.Revit.DB Namespace